Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1064dah169.h
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF860630)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF860634)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF860638)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF86063C)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF860640)));
typedef union {
  struct {
    uint32_t ODCG0:1;
    uint32_t ODCG1:1;
    uint32_t :4;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
    uint32_t :2;
    uint32_t ODCG12:1;
    uint32_t ODCG13:1;
    uint32_t ODCG14:1;
    uint32_t ODCG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF860640)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF860644)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF860648)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF86064C)));
#define CNPUG CNPUG
extern volatile uint32_t   CNPUG __attribute__((section("sfrs"), address(0xBF860650)));
typedef union {
  struct {
    uint32_t CNPUG0:1;
    uint32_t CNPUG1:1;
    uint32_t :4;
    uint32_t CNPUG6:1;
    uint32_t CNPUG7:1;
    uint32_t CNPUG8:1;
    uint32_t CNPUG9:1;
    uint32_t :2;
    uint32_t CNPUG12:1;
    uint32_t CNPUG13:1;
    uint32_t CNPUG14:1;
    uint32_t CNPUG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs"), address(0xBF860650)));
extern volatile uint32_t        CNPUGCLR __attribute__((section("sfrs"),address(0xBF860654)));
extern volatile uint32_t        CNPUGSET __attribute__((section("sfrs"),address(0xBF860658)));
extern volatile uint32_t        CNPUGINV __attribute__((section("sfrs"),address(0xBF86065C)));
#define CNPDG CNPDG
extern volatile uint32_t   CNPDG __attribute__((section("sfrs"), address(0xBF860660)));
typedef union {
  struct {
    uint32_t CNPDG0:1;
    uint32_t CNPDG1:1;
    uint32_t :4;
    uint32_t CNPDG6:1;
    uint32_t CNPDG7:1;
    uint32_t CNPDG8:1;
    uint32_t CNPDG9:1;
    uint32_t :2;
    uint32_t CNPDG12:1;
    uint32_t CNPDG13:1;
    uint32_t CNPDG14:1;
    uint32_t CNPDG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs"), address(0xBF860660)));
extern volatile uint32_t        CNPDGCLR __attribute__((section("sfrs"),address(0xBF860664)));
extern volatile uint32_t        CNPDGSET __attribute__((section("sfrs"),address(0xBF860668)));
extern volatile uint32_t        CNPDGINV __attribute__((section("sfrs"),address(0xBF86066C)));
#define CNCONG CNCONG
extern volatile uint32_t   CNCONG __attribute__((section("sfrs"), address(0xBF860670)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs"), address(0xBF860670)));
extern volatile uint32_t        CNCONGCLR __attribute__((section("sfrs"),address(0xBF860674)));
extern volatile uint32_t        CNCONGSET __attribute__((section("sfrs"),address(0xBF860678)));
extern volatile uint32_t        CNCONGINV __attribute__((section("sfrs"),address(0xBF86067C)));
#define CNENG CNENG
extern volatile uint32_t   CNENG __attribute__((section("sfrs"), address(0xBF860680)));
typedef union {
  struct {
    uint32_t CNIEG0:1;
    uint32_t CNIEG1:1;
    uint32_t :4;
    uint32_t CNIEG6:1;
    uint32_t CNIEG7:1;
    uint32_t CNIEG8:1;
    uint32_t CNIEG9:1;
    uint32_t :2;
    uint32_t CNIEG12:1;
    uint32_t CNIEG13:1;
    uint32_t CNIEG14:1;
    uint32_t CNIEG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t CNSTATG0:1;
    uint32_t CNSTATG1:1;
    uint32_t :4;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
    uint32_t :2;
    uint32_t CNSTATG12:1;
    uint32_t CNSTATG13:1;
    uint32_t CNSTATG14:1;
    uint32_t CNSTATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define CNNEG CNNEG
extern volatile uint32_t   CNNEG __attribute__((section("sfrs"), address(0xBF8606A0)));
typedef struct {
  uint32_t CNNEG0:1;
  uint32_t CNNEG1:1;
  uint32_t :4;
  uint32_t CNNEG6:1;
  uint32_t CNNEG7:1;
  uint32_t CNNEG8:1;
  uint32_t CNNEG9:1;
  uint32_t :2;
  uint32_t CNNEG12:1;
  uint32_t CNNEG13:1;
  uint32_t CNNEG14:1;
  uint32_t CNNEG15:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs"), address(0xBF8606A0)));
extern volatile uint32_t        CNNEGCLR __attribute__((section("sfrs"),address(0xBF8606A4)));
extern volatile uint32_t        CNNEGSET __attribute__((section("sfrs"),address(0xBF8606A8)));
extern volatile uint32_t        CNNEGINV __attribute__((section("sfrs"),address(0xBF8606AC)));
#define CNFG CNFG
extern volatile uint32_t   CNFG __attribute__((section("sfrs"), address(0xBF8606B0)));
typedef struct {
  uint32_t CNFG0:1;
  uint32_t CNFG1:1;
  uint32_t :4;
  uint32_t CNFG6:1;
  uint32_t CNFG7:1;
  uint32_t CNFG8:1;
  uint32_t CNFG9:1;
  uint32_t :2;
  uint32_t CNFG12:1;
  uint32_t CNFG13:1;
  uint32_t CNFG14:1;
  uint32_t CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs"), address(0xBF8606B0)));
extern volatile uint32_t        CNFGCLR __attribute__((section("sfrs"),address(0xBF8606B4)));
extern volatile uint32_t        CNFGSET __attribute__((section("sfrs"),address(0xBF8606B8)));
extern volatile uint32_t        CNFGINV __attribute__((section("sfrs"),address(0xBF8606BC)));
#define SRCON0G SRCON0G
extern volatile uint32_t   SRCON0G __attribute__((section("sfrs"), address(0xBF8606C0)));
typedef struct {
  uint32_t SR0G0:1;
  uint32_t SR0G1:1;
  uint32_t :4;
  uint32_t SR0G6:1;
  uint32_t SR0G7:1;
  uint32_t SR0G8:1;
  uint32_t SR0G9:1;
  uint32_t :2;
  uint32_t SR0G12:1;
  uint32_t SR0G13:1;
  uint32_t SR0G14:1;
  uint32_t SR0G15:1;
} __SRCON0Gbits_t;
extern volatile __SRCON0Gbits_t SRCON0Gbits __asm__ ("SRCON0G") __attribute__((section("sfrs"), address(0xBF8606C0)));
extern volatile uint32_t        SRCON0GCLR __attribute__((section("sfrs"),address(0xBF8606C4)));
extern volatile uint32_t        SRCON0GSET __attribute__((section("sfrs"),address(0xBF8606C8)));
extern volatile uint32_t        SRCON0GINV __attribute__((section("sfrs"),address(0xBF8606CC)));
#define SRCON1G SRCON1G
extern volatile uint32_t   SRCON1G __attribute__((section("sfrs"), address(0xBF8606D0)));
typedef struct {
  uint32_t SR1G0:1;
  uint32_t SR1G1:1;
  uint32_t :4;
  uint32_t SR1G6:1;
  uint32_t SR1G7:1;
  uint32_t SR1G8:1;
  uint32_t SR1G9:1;
  uint32_t :2;
  uint32_t SR1G12:1;
  uint32_t SR1G13:1;
  uint32_t SR1G14:1;
  uint32_t SR1G15:1;
} __SRCON1Gbits_t;
extern volatile __SRCON1Gbits_t SRCON1Gbits __asm__ ("SRCON1G") __attribute__((section("sfrs"), address(0xBF8606D0)));
extern volatile uint32_t        SRCON1GCLR __attribute__((section("sfrs"),address(0xBF8606D4)));
extern volatile uint32_t        SRCON1GSET __attribute__((section("sfrs"),address(0xBF8606D8)));
extern volatile uint32_t        SRCON1GINV __attribute__((section("sfrs"),address(0xBF8606DC)));
#define ANSELH ANSELH
extern volatile uint32_t   ANSELH __attribute__((section("sfrs"), address(0xBF860700)));
typedef union {
  struct {
    uint32_t :3;
    uint32_t ANSH3:1;
    uint32_t ANSH4:1;
    uint32_t :2;
    uint32_t ANSH7:1;
    uint32_t :3;
    uint32_t ANSH11:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELHbits_t;
extern volatile __ANSELHbits_t ANSELHbits __asm__ ("ANSELH") __attribute__((section("sfrs"), address(0xBF860700)));
extern volatile uint32_t        ANSELHCLR __attribute__((section("sfrs"),address(0xBF860704)));
extern volatile uint32_t        ANSELHSET __attribute__((section("sfrs"),address(0xBF860708)));
extern volatile uint32_t        ANSELHINV __attribute__((section("sfrs"),address(0xBF86070C)));
#define TRISH TRISH
extern volatile uint32_t   TRISH __attribute__((section("sfrs"), address(0xBF860710)));
typedef union {
  struct {
    uint32_t TRISH0:1;
    uint32_t TRISH1:1;
    uint32_t TRISH2:1;
    uint32_t TRISH3:1;
    uint32_t TRISH4:1;
    uint32_t TRISH5:1;
    uint32_t TRISH6:1;
    uint32_t TRISH7:1;
    uint32_t TRISH8:1;
    uint32_t TRISH9:1;
    uint32_t TRISH10:1;
    uint32_t TRISH11:1;
    uint32_t TRISH12:1;
    uint32_t TRISH13:1;
    uint32_t TRISH14:1;
    uint32_t TRISH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISHbits_t;
extern volatile __TRISHbits_t TRISHbits __asm__ ("TRISH") __attribute__((section("sfrs"), address(0xBF860710)));
extern volatile uint32_t        TRISHCLR __attribute__((section("sfrs"),address(0xBF860714)));
extern volatile uint32_t        TRISHSET __attribute__((section("sfrs"),address(0xBF860718)));
extern volatile uint32_t        TRISHINV __attribute__((section("sfrs"),address(0xBF86071C)));
#define PORTH PORTH
extern volatile uint32_t   PORTH __attribute__((section("sfrs"), address(0xBF860720)));
typedef union {
  struct {
    uint32_t RH0:1;
    uint32_t RH1:1;
    uint32_t RH2:1;
    uint32_t RH3:1;
    uint32_t RH4:1;
    uint32_t RH5:1;
    uint32_t RH6:1;
    uint32_t RH7:1;
    uint32_t RH8:1;
    uint32_t RH9:1;
    uint32_t RH10:1;
    uint32_t RH11:1;
    uint32_t RH12:1;
    uint32_t RH13:1;
    uint32_t RH14:1;
    uint32_t RH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTHbits_t;
extern volatile __PORTHbits_t PORTHbits __asm__ ("PORTH") __attribute__((section("sfrs"), address(0xBF860720)));
extern volatile uint32_t        PORTHCLR __attribute__((section("sfrs"),address(0xBF860724)));
extern volatile uint32_t        PORTHSET __attribute__((section("sfrs"),address(0xBF860728)));
extern volatile uint32_t        PORTHINV __attribute__((section("sfrs"),address(0xBF86072C)));
#define LATH LATH
extern volatile uint32_t   LATH __attribute__((section("sfrs"), address(0xBF860730)));
typedef union {
  struct {
    uint32_t LATH0:1;
    uint32_t LATH1:1;
    uint32_t LATH2:1;
    uint32_t LATH3:1;
    uint32_t LATH4:1;
    uint32_t LATH5:1;
    uint32_t LATH6:1;
    uint32_t LATH7:1;
    uint32_t LATH8:1;
    uint32_t LATH9:1;
    uint32_t LATH10:1;
    uint32_t LATH11:1;
    uint32_t LATH12:1;
    uint32_t LATH13:1;
    uint32_t LATH14:1;
    uint32_t LATH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATHbits_t;
extern volatile __LATHbits_t LATHbits __asm__ ("LATH") __attribute__((section("sfrs"), address(0xBF860730)));
extern volatile uint32_t        LATHCLR __attribute__((section("sfrs"),address(0xBF860734)));
extern volatile uint32_t        LATHSET __attribute__((section("sfrs"),address(0xBF860738)));
extern volatile uint32_t        LATHINV __attribute__((section("sfrs"),address(0xBF86073C)));
#define ODCH ODCH
extern volatile uint32_t   ODCH __attribute__((section("sfrs"), address(0xBF860740)));
typedef union {
  struct {
    uint32_t ODCH0:1;
    uint32_t ODCH1:1;
    uint32_t ODCH2:1;
    uint32_t ODCH3:1;
    uint32_t ODCH4:1;
    uint32_t ODCH5:1;
    uint32_t ODCH6:1;
    uint32_t ODCH7:1;
    uint32_t ODCH8:1;
    uint32_t ODCH9:1;
    uint32_t ODCH10:1;
    uint32_t ODCH11:1;
    uint32_t ODCH12:1;
    uint32_t ODCH13:1;
    uint32_t ODCH14:1;
    uint32_t ODCH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCHbits_t;
extern volatile __ODCHbits_t ODCHbits __asm__ ("ODCH") __attribute__((section("sfrs"), address(0xBF860740)));
extern volatile uint32_t        ODCHCLR __attribute__((section("sfrs"),address(0xBF860744)));
extern volatile uint32_t        ODCHSET __attribute__((section("sfrs"),address(0xBF860748)));
extern volatile uint32_t        ODCHINV __attribute__((section("sfrs"),address(0xBF86074C)));
#define CNPUH CNPUH
extern volatile uint32_t   CNPUH __attribute__((section("sfrs"), address(0xBF860750)));
typedef union {
  struct {
    uint32_t CNPUH0:1;
    uint32_t CNPUH1:1;
    uint32_t CNPUH2:1;
    uint32_t CNPUH3:1;
    uint32_t CNPUH4:1;
    uint32_t CNPUH5:1;
    uint32_t CNPUH6:1;
    uint32_t CNPUH7:1;
    uint32_t CNPUH8:1;
    uint32_t CNPUH9:1;
    uint32_t CNPUH10:1;
    uint32_t CNPUH11:1;
    uint32_t CNPUH12:1;
    uint32_t CNPUH13:1;
    uint32_t CNPUH14:1;
    uint32_t CNPUH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUHbits_t;
extern volatile __CNPUHbits_t CNPUHbits __asm__ ("CNPUH") __attribute__((section("sfrs"), address(0xBF860750)));
extern volatile uint32_t        CNPUHCLR __attribute__((section("sfrs"),address(0xBF860754)));
extern volatile uint32_t        CNPUHSET __attribute__((section("sfrs"),address(0xBF860758)));
extern volatile uint32_t        CNPUHINV __attribute__((section("sfrs"),address(0xBF86075C)));
#define CNPDH CNPDH
extern volatile uint32_t   CNPDH __attribute__((section("sfrs"), address(0xBF860760)));
typedef union {
  struct {
    uint32_t CNPDH0:1;
    uint32_t CNPDH1:1;
    uint32_t CNPDH2:1;
    uint32_t CNPDH3:1;
    uint32_t CNPDH4:1;
    uint32_t CNPDH5:1;
    uint32_t CNPDH6:1;
    uint32_t CNPDH7:1;
    uint32_t CNPDH8:1;
    uint32_t CNPDH9:1;
    uint32_t CNPDH10:1;
    uint32_t CNPDH11:1;
    uint32_t CNPDH12:1;
    uint32_t CNPDH13:1;
    uint32_t CNPDH14:1;
    uint32_t CNPDH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDHbits_t;
extern volatile __CNPDHbits_t CNPDHbits __asm__ ("CNPDH") __attribute__((section("sfrs"), address(0xBF860760)));
extern volatile uint32_t        CNPDHCLR __attribute__((section("sfrs"),address(0xBF860764)));
extern volatile uint32_t        CNPDHSET __attribute__((section("sfrs"),address(0xBF860768)));
extern volatile uint32_t        CNPDHINV __attribute__((section("sfrs"),address(0xBF86076C)));
#define CNCONH CNCONH
extern volatile uint32_t   CNCONH __attribute__((section("sfrs"), address(0xBF860770)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONHbits_t;
extern volatile __CNCONHbits_t CNCONHbits __asm__ ("CNCONH") __attribute__((section("sfrs"), address(0xBF860770)));
extern volatile uint32_t        CNCONHCLR __attribute__((section("sfrs"),address(0xBF860774)));
extern volatile uint32_t        CNCONHSET __attribute__((section("sfrs"),address(0xBF860778)));
extern volatile uint32_t        CNCONHINV __attribute__((section("sfrs"),address(0xBF86077C)));
#define CNENH CNENH
extern volatile uint32_t   CNENH __attribute__((section("sfrs"), address(0xBF860780)));
typedef union {
  struct {
    uint32_t CNIEH0:1;
    uint32_t CNIEH1:1;
    uint32_t CNIEH2:1;
    uint32_t CNIEH3:1;
    uint32_t CNIEH4:1;
    uint32_t CNIEH5:1;
    uint32_t CNIEH6:1;
    uint32_t CNIEH7:1;
    uint32_t CNIEH8:1;
    uint32_t CNIEH9:1;
    uint32_t CNIEH10:1;
    uint32_t CNIEH11:1;
    uint32_t CNIEH12:1;
    uint32_t CNIEH13:1;
    uint32_t CNIEH14:1;
    uint32_t CNIEH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENHbits_t;
extern volatile __CNENHbits_t CNENHbits __asm__ ("CNENH") __attribute__((section("sfrs"), address(0xBF860780)));
extern volatile uint32_t        CNENHCLR __attribute__((section("sfrs"),address(0xBF860784)));
extern volatile uint32_t        CNENHSET __attribute__((section("sfrs"),address(0xBF860788)));
extern volatile uint32_t        CNENHINV __attribute__((section("sfrs"),address(0xBF86078C)));
#define CNSTATH CNSTATH
extern volatile uint32_t   CNSTATH __attribute__((section("sfrs"), address(0xBF860790)));
typedef union {
  struct {
    uint32_t CNSTATH0:1;
    uint32_t CNSTATH1:1;
    uint32_t CNSTATH2:1;
    uint32_t CNSTATH3:1;
    uint32_t CNSTATH4:1;
    uint32_t CNSTATH5:1;
    uint32_t CNSTATH6:1;
    uint32_t CNSTATH7:1;
    uint32_t CNSTATH8:1;
    uint32_t CNSTATH9:1;
    uint32_t CNSTATH10:1;
    uint32_t CNSTATH11:1;
    uint32_t CNSTATH12:1;
    uint32_t CNSTATH13:1;
    uint32_t CNSTATH14:1;
    uint32_t CNSTATH15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATHbits_t;
extern volatile __CNSTATHbits_t CNSTATHbits __asm__ ("CNSTATH") __attribute__((section("sfrs"), address(0xBF860790)));
extern volatile uint32_t        CNSTATHCLR __attribute__((section("sfrs"),address(0xBF860794)));
extern volatile uint32_t        CNSTATHSET __attribute__((section("sfrs"),address(0xBF860798)));
extern volatile uint32_t        CNSTATHINV __attribute__((section("sfrs"),address(0xBF86079C)));
#define CNNEH CNNEH
extern volatile uint32_t   CNNEH __attribute__((section("sfrs"), address(0xBF8607A0)));
typedef struct {
  uint32_t CNNEH0:1;
  uint32_t CNNEH1:1;
  uint32_t CNNEH2:1;
  uint32_t CNNEH3:1;
  uint32_t CNNEH4:1;
  uint32_t CNNEH5:1;
  uint32_t CNNEH6:1;
  uint32_t CNNEH7:1;
  uint32_t CNNEH8:1;
  uint32_t CNNEH9:1;
  uint32_t CNNEH10:1;
  uint32_t CNNEH11:1;
  uint32_t CNNEH12:1;
  uint32_t CNNEH13:1;
  uint32_t CNNEH14:1;
  uint32_t CNNEH15:1;
} __CNNEHbits_t;
extern volatile __CNNEHbits_t CNNEHbits __asm__ ("CNNEH") __attribute__((section("sfrs"), address(0xBF8607A0)));
extern volatile uint32_t        CNNEHCLR __attribute__((section("sfrs"),address(0xBF8607A4)));
extern volatile uint32_t        CNNEHSET __attribute__((section("sfrs"),address(0xBF8607A8)));
extern volatile uint32_t        CNNEHINV __attribute__((section("sfrs"),address(0xBF8607AC)));
#define CNFH CNFH
extern volatile uint32_t   CNFH __attribute__((section("sfrs"), address(0xBF8607B0)));
typedef struct {
  uint32_t CNFH0:1;
  uint32_t CNFH1:1;
  uint32_t CNFH2:1;
  uint32_t CNFH3:1;
  uint32_t CNFH4:1;
  uint32_t CNFH5:1;
  uint32_t CNFH6:1;
  uint32_t CNFH7:1;
  uint32_t CNFH8:1;
  uint32_t CNFH9:1;
  uint32_t CNFH10:1;
  uint32_t CNFH11:1;
  uint32_t CNFH12:1;
  uint32_t CNFH13:1;
  uint32_t CNFH14:1;
  uint32_t CNFH15:1;
} __CNFHbits_t;
extern volatile __CNFHbits_t CNFHbits __asm__ ("CNFH") __attribute__((section("sfrs"), address(0xBF8607B0)));
extern volatile uint32_t        CNFHCLR __attribute__((section("sfrs"),address(0xBF8607B4)));
extern volatile uint32_t        CNFHSET __attribute__((section("sfrs"),address(0xBF8607B8)));
extern volatile uint32_t        CNFHINV __attribute__((section("sfrs"),address(0xBF8607BC)));
#define SRCON0H SRCON0H
extern volatile uint32_t   SRCON0H __attribute__((section("sfrs"), address(0xBF8607C0)));
typedef struct {
  uint32_t SR0H0:1;
  uint32_t SR0H1:1;
  uint32_t SR0H2:1;
  uint32_t SR0H3:1;
  uint32_t SR0H4:1;
  uint32_t SR0H5:1;
  uint32_t SR0H6:1;
  uint32_t SR0H7:1;
  uint32_t SR0H8:1;
  uint32_t SR0H9:1;
  uint32_t SR0H10:1;
  uint32_t SR0H11:1;
  uint32_t SR0H12:1;
  uint32_t SR0H13:1;
  uint32_t SR0H14:1;
  uint32_t SR0H15:1;
} __SRCON0Hbits_t;
